espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_dsi_bridge_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** DSI_BRG_CLK_EN_REG register
 *  dsi bridge clk control register
 */
#define DSI_BRG_CLK_EN_REG (DR_REG_DSI_BRG_BASE + 0x0)
/** DSI_BRG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures force_on of dsi_bridge register clock gate
 */
#define DSI_BRG_CLK_EN    (BIT(0))
#define DSI_BRG_CLK_EN_M  (DSI_BRG_CLK_EN_V << DSI_BRG_CLK_EN_S)
#define DSI_BRG_CLK_EN_V  0x00000001U
#define DSI_BRG_CLK_EN_S  0

/** DSI_BRG_EN_REG register
 *  dsi bridge en register
 */
#define DSI_BRG_EN_REG (DR_REG_DSI_BRG_BASE + 0x4)
/** DSI_BRG_DSI_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures module enable of dsi_bridge. 0: disable, 1: enable
 */
#define DSI_BRG_DSI_EN    (BIT(0))
#define DSI_BRG_DSI_EN_M  (DSI_BRG_DSI_EN_V << DSI_BRG_DSI_EN_S)
#define DSI_BRG_DSI_EN_V  0x00000001U
#define DSI_BRG_DSI_EN_S  0

/** DSI_BRG_DMA_REQ_CFG_REG register
 *  dsi bridge dma burst len register
 */
#define DSI_BRG_DMA_REQ_CFG_REG (DR_REG_DSI_BRG_BASE + 0x8)
/** DSI_BRG_DMA_BURST_LEN : R/W; bitpos: [11:0]; default: 128;
 *  this field configures the num of 64-bit in one dma burst transfer, valid only when
 *  dsi_bridge as flow controller
 */
#define DSI_BRG_DMA_BURST_LEN    0x00000FFFU
#define DSI_BRG_DMA_BURST_LEN_M  (DSI_BRG_DMA_BURST_LEN_V << DSI_BRG_DMA_BURST_LEN_S)
#define DSI_BRG_DMA_BURST_LEN_V  0x00000FFFU
#define DSI_BRG_DMA_BURST_LEN_S  0

/** DSI_BRG_RAW_NUM_CFG_REG register
 *  dsi bridge raw number control register
 */
#define DSI_BRG_RAW_NUM_CFG_REG (DR_REG_DSI_BRG_BASE + 0xc)
/** DSI_BRG_RAW_NUM_TOTAL : R/W; bitpos: [21:0]; default: 230400;
 *  this field configures number of total pix bits/64
 */
#define DSI_BRG_RAW_NUM_TOTAL    0x003FFFFFU
#define DSI_BRG_RAW_NUM_TOTAL_M  (DSI_BRG_RAW_NUM_TOTAL_V << DSI_BRG_RAW_NUM_TOTAL_S)
#define DSI_BRG_RAW_NUM_TOTAL_V  0x003FFFFFU
#define DSI_BRG_RAW_NUM_TOTAL_S  0
/** DSI_BRG_UNALIGN_64BIT_EN : R/W; bitpos: [22]; default: 0;
 *  this field configures whether the total pix bits is a multiple of 64bits. 0: align
 *  to 64-bit, 1: unalign to 64-bit
 */
#define DSI_BRG_UNALIGN_64BIT_EN    (BIT(22))
#define DSI_BRG_UNALIGN_64BIT_EN_M  (DSI_BRG_UNALIGN_64BIT_EN_V << DSI_BRG_UNALIGN_64BIT_EN_S)
#define DSI_BRG_UNALIGN_64BIT_EN_V  0x00000001U
#define DSI_BRG_UNALIGN_64BIT_EN_S  22
/** DSI_BRG_RAW_NUM_TOTAL_SET : WT; bitpos: [31]; default: 0;
 *  this bit configures enable of reload reg_raw_num_total to internal cnt. 0: disable,
 *  1: enable. valid only when dsi_bridge as flow controller
 */
#define DSI_BRG_RAW_NUM_TOTAL_SET    (BIT(31))
#define DSI_BRG_RAW_NUM_TOTAL_SET_M  (DSI_BRG_RAW_NUM_TOTAL_SET_V << DSI_BRG_RAW_NUM_TOTAL_SET_S)
#define DSI_BRG_RAW_NUM_TOTAL_SET_V  0x00000001U
#define DSI_BRG_RAW_NUM_TOTAL_SET_S  31

/** DSI_BRG_RAW_BUF_CREDIT_CTL_REG register
 *  dsi bridge credit register
 */
#define DSI_BRG_RAW_BUF_CREDIT_CTL_REG (DR_REG_DSI_BRG_BASE + 0x10)
/** DSI_BRG_CREDIT_THRD : R/W; bitpos: [14:0]; default: 1024;
 *  this field configures the threshold whether dsi_bridge fifo can receive one more
 *  64-bit, valid only when dsi_bridge as flow controller
 */
#define DSI_BRG_CREDIT_THRD    0x00007FFFU
#define DSI_BRG_CREDIT_THRD_M  (DSI_BRG_CREDIT_THRD_V << DSI_BRG_CREDIT_THRD_S)
#define DSI_BRG_CREDIT_THRD_V  0x00007FFFU
#define DSI_BRG_CREDIT_THRD_S  0
/** DSI_BRG_CREDIT_BURST_THRD : R/W; bitpos: [30:16]; default: 800;
 *  this field configures the threshold whether dsi_bridge fifo can receive one more
 *  dma burst, valid only when dsi_bridge as flow controller
 */
#define DSI_BRG_CREDIT_BURST_THRD    0x00007FFFU
#define DSI_BRG_CREDIT_BURST_THRD_M  (DSI_BRG_CREDIT_BURST_THRD_V << DSI_BRG_CREDIT_BURST_THRD_S)
#define DSI_BRG_CREDIT_BURST_THRD_V  0x00007FFFU
#define DSI_BRG_CREDIT_BURST_THRD_S  16
/** DSI_BRG_CREDIT_RESET : R/W; bitpos: [31]; default: 0;
 *  this bit configures internal credit cnt clear, 0: non, 1: reset. valid only when
 *  dsi_bridge as flow controller
 */
#define DSI_BRG_CREDIT_RESET    (BIT(31))
#define DSI_BRG_CREDIT_RESET_M  (DSI_BRG_CREDIT_RESET_V << DSI_BRG_CREDIT_RESET_S)
#define DSI_BRG_CREDIT_RESET_V  0x00000001U
#define DSI_BRG_CREDIT_RESET_S  31

/** DSI_BRG_FIFO_FLOW_STATUS_REG register
 *  dsi bridge raw buffer depth register
 */
#define DSI_BRG_FIFO_FLOW_STATUS_REG (DR_REG_DSI_BRG_BASE + 0x14)
/** DSI_BRG_RAW_BUF_DEPTH : RO; bitpos: [13:0]; default: 0;
 *  this field configures the depth of dsi_bridge fifo depth
 */
#define DSI_BRG_RAW_BUF_DEPTH    0x00003FFFU
#define DSI_BRG_RAW_BUF_DEPTH_M  (DSI_BRG_RAW_BUF_DEPTH_V << DSI_BRG_RAW_BUF_DEPTH_S)
#define DSI_BRG_RAW_BUF_DEPTH_V  0x00003FFFU
#define DSI_BRG_RAW_BUF_DEPTH_S  0

/** DSI_BRG_PIXEL_TYPE_REG register
 *  dsi bridge dpi type control register
 */
#define DSI_BRG_PIXEL_TYPE_REG (DR_REG_DSI_BRG_BASE + 0x18)
/** DSI_BRG_RAW_TYPE : R/W; bitpos: [3:0]; default: 0;
 *  this field configures the pixel type. 0: rgb888, 1:rgb666, 2:rgb565
 */
#define DSI_BRG_RAW_TYPE    0x0000000FU
#define DSI_BRG_RAW_TYPE_M  (DSI_BRG_RAW_TYPE_V << DSI_BRG_RAW_TYPE_S)
#define DSI_BRG_RAW_TYPE_V  0x0000000FU
#define DSI_BRG_RAW_TYPE_S  0
/** DSI_BRG_DPI_CONFIG : R/W; bitpos: [5:4]; default: 0;
 *  this field configures the pixel arrange type of dpi interface
 */
#define DSI_BRG_DPI_CONFIG    0x00000003U
#define DSI_BRG_DPI_CONFIG_M  (DSI_BRG_DPI_CONFIG_V << DSI_BRG_DPI_CONFIG_S)
#define DSI_BRG_DPI_CONFIG_V  0x00000003U
#define DSI_BRG_DPI_CONFIG_S  4
/** DSI_BRG_DATA_IN_TYPE : R/W; bitpos: [6]; default: 0;
 *  input data type, 0: rgb, 1: yuv
 */
#define DSI_BRG_DATA_IN_TYPE    (BIT(6))
#define DSI_BRG_DATA_IN_TYPE_M  (DSI_BRG_DATA_IN_TYPE_V << DSI_BRG_DATA_IN_TYPE_S)
#define DSI_BRG_DATA_IN_TYPE_V  0x00000001U
#define DSI_BRG_DATA_IN_TYPE_S  6

/** DSI_BRG_DMA_BLOCK_INTERVAL_REG register
 *  dsi bridge dma block interval control register
 */
#define DSI_BRG_DMA_BLOCK_INTERVAL_REG (DR_REG_DSI_BRG_BASE + 0x1c)
/** DSI_BRG_DMA_BLOCK_SLOT : R/W; bitpos: [9:0]; default: 9;
 *  this field configures the max block_slot_cnt
 */
#define DSI_BRG_DMA_BLOCK_SLOT    0x000003FFU
#define DSI_BRG_DMA_BLOCK_SLOT_M  (DSI_BRG_DMA_BLOCK_SLOT_V << DSI_BRG_DMA_BLOCK_SLOT_S)
#define DSI_BRG_DMA_BLOCK_SLOT_V  0x000003FFU
#define DSI_BRG_DMA_BLOCK_SLOT_S  0
/** DSI_BRG_DMA_BLOCK_INTERVAL : R/W; bitpos: [27:10]; default: 9;
 *  this field configures the max block_interval_cnt, block_interval_cnt increased by 1
 *  when block_slot_cnt if full
 */
#define DSI_BRG_DMA_BLOCK_INTERVAL    0x0003FFFFU
#define DSI_BRG_DMA_BLOCK_INTERVAL_M  (DSI_BRG_DMA_BLOCK_INTERVAL_V << DSI_BRG_DMA_BLOCK_INTERVAL_S)
#define DSI_BRG_DMA_BLOCK_INTERVAL_V  0x0003FFFFU
#define DSI_BRG_DMA_BLOCK_INTERVAL_S  10
/** DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD : R/W; bitpos: [28]; default: 1;
 *  this bit configures enable of auto reload reg_raw_num_total, 0: disable, 1: enable
 */
#define DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD    (BIT(28))
#define DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD_M  (DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD_V << DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD_S)
#define DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD_V  0x00000001U
#define DSI_BRG_RAW_NUM_TOTAL_AUTO_RELOAD_S  28
/** DSI_BRG_DMA_BLOCK_INTERVAL_EN : R/W; bitpos: [29]; default: 1;
 *  this bit configures enable of interval between dma block transfer, 0: disable, 1:
 *  enable
 */
#define DSI_BRG_DMA_BLOCK_INTERVAL_EN    (BIT(29))
#define DSI_BRG_DMA_BLOCK_INTERVAL_EN_M  (DSI_BRG_DMA_BLOCK_INTERVAL_EN_V << DSI_BRG_DMA_BLOCK_INTERVAL_EN_S)
#define DSI_BRG_DMA_BLOCK_INTERVAL_EN_V  0x00000001U
#define DSI_BRG_DMA_BLOCK_INTERVAL_EN_S  29

/** DSI_BRG_DMA_REQ_INTERVAL_REG register
 *  dsi bridge dma req interval control register
 */
#define DSI_BRG_DMA_REQ_INTERVAL_REG (DR_REG_DSI_BRG_BASE + 0x20)
/** DSI_BRG_DMA_REQ_INTERVAL : R/W; bitpos: [15:0]; default: 1;
 *  this field configures the interval between dma req events
 */
#define DSI_BRG_DMA_REQ_INTERVAL    0x0000FFFFU
#define DSI_BRG_DMA_REQ_INTERVAL_M  (DSI_BRG_DMA_REQ_INTERVAL_V << DSI_BRG_DMA_REQ_INTERVAL_S)
#define DSI_BRG_DMA_REQ_INTERVAL_V  0x0000FFFFU
#define DSI_BRG_DMA_REQ_INTERVAL_S  0

