espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_dsi_bridge_reg.h
/** DSI_BRG_DPI_LCD_CTL_REG register
 *  dsi bridge dpi signal control register
 */
#define DSI_BRG_DPI_LCD_CTL_REG (DR_REG_DSI_BRG_BASE + 0x24)
/** DSI_BRG_DPISHUTDN : R/W; bitpos: [0]; default: 0;
 *  this bit configures dpishutdn signal in dpi interface
 */
#define DSI_BRG_DPISHUTDN    (BIT(0))
#define DSI_BRG_DPISHUTDN_M  (DSI_BRG_DPISHUTDN_V << DSI_BRG_DPISHUTDN_S)
#define DSI_BRG_DPISHUTDN_V  0x00000001U
#define DSI_BRG_DPISHUTDN_S  0
/** DSI_BRG_DPICOLORM : R/W; bitpos: [1]; default: 0;
 *  this bit configures dpicolorm signal in dpi interface
 */
#define DSI_BRG_DPICOLORM    (BIT(1))
#define DSI_BRG_DPICOLORM_M  (DSI_BRG_DPICOLORM_V << DSI_BRG_DPICOLORM_S)
#define DSI_BRG_DPICOLORM_V  0x00000001U
#define DSI_BRG_DPICOLORM_S  1
/** DSI_BRG_DPIUPDATECFG : R/W; bitpos: [2]; default: 0;
 *  this bit configures dpiupdatecfg signal in dpi interface
 */
#define DSI_BRG_DPIUPDATECFG    (BIT(2))
#define DSI_BRG_DPIUPDATECFG_M  (DSI_BRG_DPIUPDATECFG_V << DSI_BRG_DPIUPDATECFG_S)
#define DSI_BRG_DPIUPDATECFG_V  0x00000001U
#define DSI_BRG_DPIUPDATECFG_S  2

/** DSI_BRG_DPI_RSV_DPI_DATA_REG register
 *  dsi bridge dpi reserved data register
 */
#define DSI_BRG_DPI_RSV_DPI_DATA_REG (DR_REG_DSI_BRG_BASE + 0x28)
/** DSI_BRG_DPI_RSV_DATA : R/W; bitpos: [29:0]; default: 16383;
 *  this field controls the pixel data sent to dsi_host when dsi_bridge fifo underflow
 */
#define DSI_BRG_DPI_RSV_DATA    0x3FFFFFFFU
#define DSI_BRG_DPI_RSV_DATA_M  (DSI_BRG_DPI_RSV_DATA_V << DSI_BRG_DPI_RSV_DATA_S)
#define DSI_BRG_DPI_RSV_DATA_V  0x3FFFFFFFU
#define DSI_BRG_DPI_RSV_DATA_S  0

/** DSI_BRG_DPI_V_CFG0_REG register
 *  dsi bridge dpi v config register 0
 */
#define DSI_BRG_DPI_V_CFG0_REG (DR_REG_DSI_BRG_BASE + 0x30)
/** DSI_BRG_VTOTAL : R/W; bitpos: [11:0]; default: 525;
 *  this field configures the total length of one frame (by line) for dpi output, must
 *  meet: reg_vtotal > reg_vdisp+reg_vsync+reg_vbank
 */
#define DSI_BRG_VTOTAL    0x00000FFFU
#define DSI_BRG_VTOTAL_M  (DSI_BRG_VTOTAL_V << DSI_BRG_VTOTAL_S)
#define DSI_BRG_VTOTAL_V  0x00000FFFU
#define DSI_BRG_VTOTAL_S  0
/** DSI_BRG_VDISP : R/W; bitpos: [27:16]; default: 480;
 *  this field configures the length of valid line (by line) for dpi output
 */
#define DSI_BRG_VDISP    0x00000FFFU
#define DSI_BRG_VDISP_M  (DSI_BRG_VDISP_V << DSI_BRG_VDISP_S)
#define DSI_BRG_VDISP_V  0x00000FFFU
#define DSI_BRG_VDISP_S  16

/** DSI_BRG_DPI_V_CFG1_REG register
 *  dsi bridge dpi v config register 1
 */
#define DSI_BRG_DPI_V_CFG1_REG (DR_REG_DSI_BRG_BASE + 0x34)
/** DSI_BRG_VBANK : R/W; bitpos: [11:0]; default: 33;
 *  this field configures the length between vsync and valid line (by line) for dpi
 *  output
 */
#define DSI_BRG_VBANK    0x00000FFFU
#define DSI_BRG_VBANK_M  (DSI_BRG_VBANK_V << DSI_BRG_VBANK_S)
#define DSI_BRG_VBANK_V  0x00000FFFU
#define DSI_BRG_VBANK_S  0
/** DSI_BRG_VSYNC : R/W; bitpos: [27:16]; default: 2;
 *  this field configures the length of vsync (by line) for dpi output
 */
#define DSI_BRG_VSYNC    0x00000FFFU
#define DSI_BRG_VSYNC_M  (DSI_BRG_VSYNC_V << DSI_BRG_VSYNC_S)
#define DSI_BRG_VSYNC_V  0x00000FFFU
#define DSI_BRG_VSYNC_S  16

/** DSI_BRG_DPI_H_CFG0_REG register
 *  dsi bridge dpi h config register 0
 */
#define DSI_BRG_DPI_H_CFG0_REG (DR_REG_DSI_BRG_BASE + 0x38)
/** DSI_BRG_HTOTAL : R/W; bitpos: [11:0]; default: 800;
 *  this field configures the total length of one line (by pixel num) for dpi output,
 *  must meet: reg_htotal > reg_hdisp+reg_hsync+reg_hbank
 */
#define DSI_BRG_HTOTAL    0x00000FFFU
#define DSI_BRG_HTOTAL_M  (DSI_BRG_HTOTAL_V << DSI_BRG_HTOTAL_S)
#define DSI_BRG_HTOTAL_V  0x00000FFFU
#define DSI_BRG_HTOTAL_S  0
/** DSI_BRG_HDISP : R/W; bitpos: [27:16]; default: 640;
 *  this field configures the length of valid pixel data (by pixel num) for dpi output
 */
#define DSI_BRG_HDISP    0x00000FFFU
#define DSI_BRG_HDISP_M  (DSI_BRG_HDISP_V << DSI_BRG_HDISP_S)
#define DSI_BRG_HDISP_V  0x00000FFFU
#define DSI_BRG_HDISP_S  16

/** DSI_BRG_DPI_H_CFG1_REG register
 *  dsi bridge dpi h config register 1
 */
#define DSI_BRG_DPI_H_CFG1_REG (DR_REG_DSI_BRG_BASE + 0x3c)
/** DSI_BRG_HBANK : R/W; bitpos: [11:0]; default: 48;
 *  this field configures the length between hsync and pixel data valid (by pixel num)
 *  for dpi output
 */
#define DSI_BRG_HBANK    0x00000FFFU
#define DSI_BRG_HBANK_M  (DSI_BRG_HBANK_V << DSI_BRG_HBANK_S)
#define DSI_BRG_HBANK_V  0x00000FFFU
#define DSI_BRG_HBANK_S  0
/** DSI_BRG_HSYNC : R/W; bitpos: [27:16]; default: 96;
 *  this field configures the length of hsync (by pixel num) for dpi output
 */
#define DSI_BRG_HSYNC    0x00000FFFU
#define DSI_BRG_HSYNC_M  (DSI_BRG_HSYNC_V << DSI_BRG_HSYNC_S)
#define DSI_BRG_HSYNC_V  0x00000FFFU
#define DSI_BRG_HSYNC_S  16

/** DSI_BRG_DPI_MISC_CONFIG_REG register
 *  dsi_bridge dpi misc config register
 */
#define DSI_BRG_DPI_MISC_CONFIG_REG (DR_REG_DSI_BRG_BASE + 0x40)
/** DSI_BRG_DPI_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures enable of dpi output, 0: disable, 1: enable
 */
#define DSI_BRG_DPI_EN    (BIT(0))
#define DSI_BRG_DPI_EN_M  (DSI_BRG_DPI_EN_V << DSI_BRG_DPI_EN_S)
#define DSI_BRG_DPI_EN_V  0x00000001U
#define DSI_BRG_DPI_EN_S  0
/** DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT : R/W; bitpos: [15:4]; default: 413;
 *  this field configures the underrun interrupt musk, when underrun occurs and line
 *  cnt is less then this field
 */
#define DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT    0x00000FFFU
#define DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT_M  (DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT_V << DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT_S)
#define DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT_V  0x00000FFFU
#define DSI_BRG_FIFO_UNDERRUN_DISCARD_VCNT_S  4

/** DSI_BRG_DPI_CONFIG_UPDATE_REG register
 *  dsi_bridge dpi config update register
 */
#define DSI_BRG_DPI_CONFIG_UPDATE_REG (DR_REG_DSI_BRG_BASE + 0x44)
/** DSI_BRG_DPI_CONFIG_UPDATE : WT; bitpos: [0]; default: 0;
 *  write 1 to this bit to update dpi config register MIPI_DSI_BRG_DPI_*
 */
#define DSI_BRG_DPI_CONFIG_UPDATE    (BIT(0))
#define DSI_BRG_DPI_CONFIG_UPDATE_M  (DSI_BRG_DPI_CONFIG_UPDATE_V << DSI_BRG_DPI_CONFIG_UPDATE_S)
#define DSI_BRG_DPI_CONFIG_UPDATE_V  0x00000001U
#define DSI_BRG_DPI_CONFIG_UPDATE_S  0

/** DSI_BRG_INT_ENA_REG register
 *  dsi_bridge interrupt enable register
 */
#define DSI_BRG_INT_ENA_REG (DR_REG_DSI_BRG_BASE + 0x50)
/** DSI_BRG_UNDERRUN_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  write 1 to enables dpi_underrun_int_st field of MIPI_DSI_BRG_INT_ST_REG controlled
 *  by dpi_underrun  interrupt signal
 */
#define DSI_BRG_UNDERRUN_INT_ENA    (BIT(0))
#define DSI_BRG_UNDERRUN_INT_ENA_M  (DSI_BRG_UNDERRUN_INT_ENA_V << DSI_BRG_UNDERRUN_INT_ENA_S)
#define DSI_BRG_UNDERRUN_INT_ENA_V  0x00000001U
#define DSI_BRG_UNDERRUN_INT_ENA_S  0

/** DSI_BRG_INT_CLR_REG register
 *  dsi_bridge interrupt clear register
 */
#define DSI_BRG_INT_CLR_REG (DR_REG_DSI_BRG_BASE + 0x54)
/** DSI_BRG_UNDERRUN_INT_CLR : WT; bitpos: [0]; default: 0;
 *  write 1 to this bit to clear dpi_underrun_int_raw field of MIPI_DSI_BRG_INT_RAW_REG
 */
#define DSI_BRG_UNDERRUN_INT_CLR    (BIT(0))
#define DSI_BRG_UNDERRUN_INT_CLR_M  (DSI_BRG_UNDERRUN_INT_CLR_V << DSI_BRG_UNDERRUN_INT_CLR_S)
#define DSI_BRG_UNDERRUN_INT_CLR_V  0x00000001U
#define DSI_BRG_UNDERRUN_INT_CLR_S  0

/** DSI_BRG_INT_RAW_REG register
 *  dsi_bridge raw interrupt register
 */
#define DSI_BRG_INT_RAW_REG (DR_REG_DSI_BRG_BASE + 0x58)
/** DSI_BRG_UNDERRUN_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  the raw interrupt status of dpi_underrun
 */
#define DSI_BRG_UNDERRUN_INT_RAW    (BIT(0))
#define DSI_BRG_UNDERRUN_INT_RAW_M  (DSI_BRG_UNDERRUN_INT_RAW_V << DSI_BRG_UNDERRUN_INT_RAW_S)
#define DSI_BRG_UNDERRUN_INT_RAW_V  0x00000001U
#define DSI_BRG_UNDERRUN_INT_RAW_S  0

