espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_dsi_bridge_reg.h
/** DSI_BRG_INT_ST_REG register
 *  dsi_bridge masked interrupt register
 */
#define DSI_BRG_INT_ST_REG (DR_REG_DSI_BRG_BASE + 0x5c)
/** DSI_BRG_UNDERRUN_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of dpi_underrun
 */
#define DSI_BRG_UNDERRUN_INT_ST    (BIT(0))
#define DSI_BRG_UNDERRUN_INT_ST_M  (DSI_BRG_UNDERRUN_INT_ST_V << DSI_BRG_UNDERRUN_INT_ST_S)
#define DSI_BRG_UNDERRUN_INT_ST_V  0x00000001U
#define DSI_BRG_UNDERRUN_INT_ST_S  0

/** DSI_BRG_HOST_BIST_CTL_REG register
 *  dsi_bridge host bist control register
 */
#define DSI_BRG_HOST_BIST_CTL_REG (DR_REG_DSI_BRG_BASE + 0x60)
/** DSI_BRG_BISTOK : RO; bitpos: [0]; default: 0;
 *  bistok
 */
#define DSI_BRG_BISTOK    (BIT(0))
#define DSI_BRG_BISTOK_M  (DSI_BRG_BISTOK_V << DSI_BRG_BISTOK_S)
#define DSI_BRG_BISTOK_V  0x00000001U
#define DSI_BRG_BISTOK_S  0
/** DSI_BRG_BISTON : R/W; bitpos: [1]; default: 0;
 *  biston
 */
#define DSI_BRG_BISTON    (BIT(1))
#define DSI_BRG_BISTON_M  (DSI_BRG_BISTON_V << DSI_BRG_BISTON_S)
#define DSI_BRG_BISTON_V  0x00000001U
#define DSI_BRG_BISTON_S  1

/** DSI_BRG_HOST_TRIGGER_REV_REG register
 *  dsi_bridge host trigger reverse control register
 */
#define DSI_BRG_HOST_TRIGGER_REV_REG (DR_REG_DSI_BRG_BASE + 0x64)
/** DSI_BRG_TX_TRIGGER_REV_EN : R/W; bitpos: [0]; default: 0;
 *  tx_trigger reverse. 0: disable, 1: enable
 */
#define DSI_BRG_TX_TRIGGER_REV_EN    (BIT(0))
#define DSI_BRG_TX_TRIGGER_REV_EN_M  (DSI_BRG_TX_TRIGGER_REV_EN_V << DSI_BRG_TX_TRIGGER_REV_EN_S)
#define DSI_BRG_TX_TRIGGER_REV_EN_V  0x00000001U
#define DSI_BRG_TX_TRIGGER_REV_EN_S  0
/** DSI_BRG_RX_TRIGGER_REV_EN : R/W; bitpos: [1]; default: 0;
 *  rx_trigger reverse. 0: disable, 1: enable
 */
#define DSI_BRG_RX_TRIGGER_REV_EN    (BIT(1))
#define DSI_BRG_RX_TRIGGER_REV_EN_M  (DSI_BRG_RX_TRIGGER_REV_EN_V << DSI_BRG_RX_TRIGGER_REV_EN_S)
#define DSI_BRG_RX_TRIGGER_REV_EN_V  0x00000001U
#define DSI_BRG_RX_TRIGGER_REV_EN_S  1

/** DSI_BRG_BLK_RAW_NUM_CFG_REG register
 *  dsi_bridge block raw number control register
 */
#define DSI_BRG_BLK_RAW_NUM_CFG_REG (DR_REG_DSI_BRG_BASE + 0x68)
/** DSI_BRG_BLK_RAW_NUM_TOTAL : R/W; bitpos: [21:0]; default: 230400;
 *  this field configures number of total block pix bits/64
 */
#define DSI_BRG_BLK_RAW_NUM_TOTAL    0x003FFFFFU
#define DSI_BRG_BLK_RAW_NUM_TOTAL_M  (DSI_BRG_BLK_RAW_NUM_TOTAL_V << DSI_BRG_BLK_RAW_NUM_TOTAL_S)
#define DSI_BRG_BLK_RAW_NUM_TOTAL_V  0x003FFFFFU
#define DSI_BRG_BLK_RAW_NUM_TOTAL_S  0
/** DSI_BRG_BLK_RAW_NUM_TOTAL_SET : WT; bitpos: [31]; default: 0;
 *  write 1 to reload reg_blk_raw_num_total to internal cnt
 */
#define DSI_BRG_BLK_RAW_NUM_TOTAL_SET    (BIT(31))
#define DSI_BRG_BLK_RAW_NUM_TOTAL_SET_M  (DSI_BRG_BLK_RAW_NUM_TOTAL_SET_V << DSI_BRG_BLK_RAW_NUM_TOTAL_SET_S)
#define DSI_BRG_BLK_RAW_NUM_TOTAL_SET_V  0x00000001U
#define DSI_BRG_BLK_RAW_NUM_TOTAL_SET_S  31

/** DSI_BRG_DMA_FRAME_INTERVAL_REG register
 *  dsi_bridge dam frame interval control register
 */
#define DSI_BRG_DMA_FRAME_INTERVAL_REG (DR_REG_DSI_BRG_BASE + 0x6c)
/** DSI_BRG_DMA_FRAME_SLOT : R/W; bitpos: [9:0]; default: 9;
 *  this field configures the max frame_slot_cnt
 */
#define DSI_BRG_DMA_FRAME_SLOT    0x000003FFU
#define DSI_BRG_DMA_FRAME_SLOT_M  (DSI_BRG_DMA_FRAME_SLOT_V << DSI_BRG_DMA_FRAME_SLOT_S)
#define DSI_BRG_DMA_FRAME_SLOT_V  0x000003FFU
#define DSI_BRG_DMA_FRAME_SLOT_S  0
/** DSI_BRG_DMA_FRAME_INTERVAL : R/W; bitpos: [27:10]; default: 9;
 *  this field configures the max frame_interval_cnt, frame_interval_cnt increased by 1
 *  when frame_slot_cnt if full
 */
#define DSI_BRG_DMA_FRAME_INTERVAL    0x0003FFFFU
#define DSI_BRG_DMA_FRAME_INTERVAL_M  (DSI_BRG_DMA_FRAME_INTERVAL_V << DSI_BRG_DMA_FRAME_INTERVAL_S)
#define DSI_BRG_DMA_FRAME_INTERVAL_V  0x0003FFFFU
#define DSI_BRG_DMA_FRAME_INTERVAL_S  10
/** DSI_BRG_DMA_MULTIBLK_EN : R/W; bitpos: [28]; default: 0;
 *  this bit configures enable multi-blk transfer, 0: disable, 1: enable
 */
#define DSI_BRG_DMA_MULTIBLK_EN    (BIT(28))
#define DSI_BRG_DMA_MULTIBLK_EN_M  (DSI_BRG_DMA_MULTIBLK_EN_V << DSI_BRG_DMA_MULTIBLK_EN_S)
#define DSI_BRG_DMA_MULTIBLK_EN_V  0x00000001U
#define DSI_BRG_DMA_MULTIBLK_EN_S  28
/** DSI_BRG_DMA_FRAME_INTERVAL_EN : R/W; bitpos: [29]; default: 1;
 *  this bit configures enable interval between frame transfer, 0: disable, 1: enable
 */
#define DSI_BRG_DMA_FRAME_INTERVAL_EN    (BIT(29))
#define DSI_BRG_DMA_FRAME_INTERVAL_EN_M  (DSI_BRG_DMA_FRAME_INTERVAL_EN_V << DSI_BRG_DMA_FRAME_INTERVAL_EN_S)
#define DSI_BRG_DMA_FRAME_INTERVAL_EN_V  0x00000001U
#define DSI_BRG_DMA_FRAME_INTERVAL_EN_S  29

/** DSI_BRG_MEM_AUX_CTRL_REG register
 *  dsi_bridge mem aux control register
 */
#define DSI_BRG_MEM_AUX_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x70)
/** DSI_BRG_DSI_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures dsi_bridge fifo memory aux ctrl
 */
#define DSI_BRG_DSI_MEM_AUX_CTRL    0x00003FFFU
#define DSI_BRG_DSI_MEM_AUX_CTRL_M  (DSI_BRG_DSI_MEM_AUX_CTRL_V << DSI_BRG_DSI_MEM_AUX_CTRL_S)
#define DSI_BRG_DSI_MEM_AUX_CTRL_V  0x00003FFFU
#define DSI_BRG_DSI_MEM_AUX_CTRL_S  0

/** DSI_BRG_RDN_ECO_CS_REG register
 *  dsi_bridge rdn eco cs register
 */
#define DSI_BRG_RDN_ECO_CS_REG (DR_REG_DSI_BRG_BASE + 0x74)
/** DSI_BRG_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  rdn_eco_en
 */
#define DSI_BRG_RDN_ECO_EN    (BIT(0))
#define DSI_BRG_RDN_ECO_EN_M  (DSI_BRG_RDN_ECO_EN_V << DSI_BRG_RDN_ECO_EN_S)
#define DSI_BRG_RDN_ECO_EN_V  0x00000001U
#define DSI_BRG_RDN_ECO_EN_S  0
/** DSI_BRG_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  rdn_eco_result
 */
#define DSI_BRG_RDN_ECO_RESULT    (BIT(1))
#define DSI_BRG_RDN_ECO_RESULT_M  (DSI_BRG_RDN_ECO_RESULT_V << DSI_BRG_RDN_ECO_RESULT_S)
#define DSI_BRG_RDN_ECO_RESULT_V  0x00000001U
#define DSI_BRG_RDN_ECO_RESULT_S  1

/** DSI_BRG_RDN_ECO_LOW_REG register
 *  dsi_bridge rdn eco all low register
 */
#define DSI_BRG_RDN_ECO_LOW_REG (DR_REG_DSI_BRG_BASE + 0x78)
/** DSI_BRG_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  rdn_eco_low
 */
#define DSI_BRG_RDN_ECO_LOW    0xFFFFFFFFU
#define DSI_BRG_RDN_ECO_LOW_M  (DSI_BRG_RDN_ECO_LOW_V << DSI_BRG_RDN_ECO_LOW_S)
#define DSI_BRG_RDN_ECO_LOW_V  0xFFFFFFFFU
#define DSI_BRG_RDN_ECO_LOW_S  0

/** DSI_BRG_RDN_ECO_HIGH_REG register
 *  dsi_bridge rdn eco all high register
 */
#define DSI_BRG_RDN_ECO_HIGH_REG (DR_REG_DSI_BRG_BASE + 0x7c)
/** DSI_BRG_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  rdn_eco_high
 */
#define DSI_BRG_RDN_ECO_HIGH    0xFFFFFFFFU
#define DSI_BRG_RDN_ECO_HIGH_M  (DSI_BRG_RDN_ECO_HIGH_V << DSI_BRG_RDN_ECO_HIGH_S)
#define DSI_BRG_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define DSI_BRG_RDN_ECO_HIGH_S  0

/** DSI_BRG_HOST_CTRL_REG register
 *  dsi_bridge host control register
 */
#define DSI_BRG_HOST_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x80)
/** DSI_BRG_DSI_CFG_REF_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  this bit configures the clk enable refclk and cfg_clk of dsi_host. 0: disable, 1:
 *  enable
 */
#define DSI_BRG_DSI_CFG_REF_CLK_EN    (BIT(0))
#define DSI_BRG_DSI_CFG_REF_CLK_EN_M  (DSI_BRG_DSI_CFG_REF_CLK_EN_V << DSI_BRG_DSI_CFG_REF_CLK_EN_S)
#define DSI_BRG_DSI_CFG_REF_CLK_EN_V  0x00000001U
#define DSI_BRG_DSI_CFG_REF_CLK_EN_S  0

/** DSI_BRG_MEM_CLK_CTRL_REG register
 *  dsi_bridge mem force on control register
 */
#define DSI_BRG_MEM_CLK_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x84)
/** DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  this bit configures the clock force on of dsi_bridge fifo memory. 0: disable, 1:
 *  force on
 */
#define DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON    (BIT(0))
#define DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON_M  (DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON_V << DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON_S)
#define DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON_V  0x00000001U
#define DSI_BRG_DSI_BRIDGE_MEM_CLK_FORCE_ON_S  0
/** DSI_BRG_DSI_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  this bit configures the clock force on of dpi fifo memory. 0: disable, 1: force on
 */
#define DSI_BRG_DSI_MEM_CLK_FORCE_ON    (BIT(1))
#define DSI_BRG_DSI_MEM_CLK_FORCE_ON_M  (DSI_BRG_DSI_MEM_CLK_FORCE_ON_V << DSI_BRG_DSI_MEM_CLK_FORCE_ON_S)
#define DSI_BRG_DSI_MEM_CLK_FORCE_ON_V  0x00000001U
#define DSI_BRG_DSI_MEM_CLK_FORCE_ON_S  1

/** DSI_BRG_DMA_FLOW_CTRL_REG register
 *  dsi_bridge dma flow controller register
 */
#define DSI_BRG_DMA_FLOW_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x88)
/** DSI_BRG_DSI_DMA_FLOW_CONTROLLER : R/W; bitpos: [0]; default: 1;
 *  this bit configures the flow controller, 0: dmac as flow controller, 1:dsi_bridge
 *  as flow controller
 */
#define DSI_BRG_DSI_DMA_FLOW_CONTROLLER    (BIT(0))
#define DSI_BRG_DSI_DMA_FLOW_CONTROLLER_M  (DSI_BRG_DSI_DMA_FLOW_CONTROLLER_V << DSI_BRG_DSI_DMA_FLOW_CONTROLLER_S)
#define DSI_BRG_DSI_DMA_FLOW_CONTROLLER_V  0x00000001U
#define DSI_BRG_DSI_DMA_FLOW_CONTROLLER_S  0
/** DSI_BRG_DMA_FLOW_MULTIBLK_NUM : R/W; bitpos: [7:4]; default: 1;
 *  this field configures the num of blocks when multi-blk is enable and dmac as flow
 *  controller
 */
#define DSI_BRG_DMA_FLOW_MULTIBLK_NUM    0x0000000FU
#define DSI_BRG_DMA_FLOW_MULTIBLK_NUM_M  (DSI_BRG_DMA_FLOW_MULTIBLK_NUM_V << DSI_BRG_DMA_FLOW_MULTIBLK_NUM_S)
#define DSI_BRG_DMA_FLOW_MULTIBLK_NUM_V  0x0000000FU
#define DSI_BRG_DMA_FLOW_MULTIBLK_NUM_S  4

/** DSI_BRG_RAW_BUF_ALMOST_EMPTY_THRD_REG register
 *  dsi_bridge buffer empty threshold register
 */
#define DSI_BRG_RAW_BUF_ALMOST_EMPTY_THRD_REG (DR_REG_DSI_BRG_BASE + 0x8c)
/** DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD : R/W; bitpos: [10:0]; default: 512;
 *  this field configures the fifo almost empty threshold, is valid only when dmac as
 *  flow controller
 */
#define DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD    0x000007FFU
#define DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD_M  (DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD_V << DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD_S)
#define DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD_V  0x000007FFU
#define DSI_BRG_DSI_RAW_BUF_ALMOST_EMPTY_THRD_S  0

/** DSI_BRG_YUV_CFG_REG register
 *  dsi_bridge yuv format config register
 */
#define DSI_BRG_YUV_CFG_REG (DR_REG_DSI_BRG_BASE + 0x90)
/** DSI_BRG_PROTOCAL : R/W; bitpos: [0]; default: 0;
 *  this bit configures yuv protoocl, 0: bt.601, 1: bt.709
 */
#define DSI_BRG_PROTOCAL    (BIT(0))
#define DSI_BRG_PROTOCAL_M  (DSI_BRG_PROTOCAL_V << DSI_BRG_PROTOCAL_S)
#define DSI_BRG_PROTOCAL_V  0x00000001U
#define DSI_BRG_PROTOCAL_S  0
/** DSI_BRG_YUV_PIX_ENDIAN : R/W; bitpos: [1]; default: 0;
 *  this bit configures yuv pixel endian, 0: y0u0y1v1y2u2y3v3, 1: y3u3y2v2y1u1y0v0
 */
#define DSI_BRG_YUV_PIX_ENDIAN    (BIT(1))
#define DSI_BRG_YUV_PIX_ENDIAN_M  (DSI_BRG_YUV_PIX_ENDIAN_V << DSI_BRG_YUV_PIX_ENDIAN_S)
#define DSI_BRG_YUV_PIX_ENDIAN_V  0x00000001U
#define DSI_BRG_YUV_PIX_ENDIAN_S  1
/** DSI_BRG_YUV422_FORMAT : R/W; bitpos: [3:2]; default: 0;
 *  this field configures yuv422 store format, 0: yuyv, 1: yvyu, 2: uyvy, 3: vyuy
 */
#define DSI_BRG_YUV422_FORMAT    0x00000003U
#define DSI_BRG_YUV422_FORMAT_M  (DSI_BRG_YUV422_FORMAT_V << DSI_BRG_YUV422_FORMAT_S)
#define DSI_BRG_YUV422_FORMAT_V  0x00000003U
#define DSI_BRG_YUV422_FORMAT_S  2

