espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_dsi_bridge_reg.h
/** DSI_BRG_PHY_LP_LOOPBACK_CTRL_REG register
 *  dsi phy lp_loopback test ctrl
 */
#define DSI_BRG_PHY_LP_LOOPBACK_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x94)
/** DSI_BRG_PHY_LP_TXDATAESC_1 : R/W; bitpos: [7:0]; default: 0;
 *  txdataesc_1 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXDATAESC_1    0x000000FFU
#define DSI_BRG_PHY_LP_TXDATAESC_1_M  (DSI_BRG_PHY_LP_TXDATAESC_1_V << DSI_BRG_PHY_LP_TXDATAESC_1_S)
#define DSI_BRG_PHY_LP_TXDATAESC_1_V  0x000000FFU
#define DSI_BRG_PHY_LP_TXDATAESC_1_S  0
/** DSI_BRG_PHY_LP_TXREQUESTESC_1 : R/W; bitpos: [8]; default: 0;
 *  txrequestesc_1 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXREQUESTESC_1    (BIT(8))
#define DSI_BRG_PHY_LP_TXREQUESTESC_1_M  (DSI_BRG_PHY_LP_TXREQUESTESC_1_V << DSI_BRG_PHY_LP_TXREQUESTESC_1_S)
#define DSI_BRG_PHY_LP_TXREQUESTESC_1_V  0x00000001U
#define DSI_BRG_PHY_LP_TXREQUESTESC_1_S  8
/** DSI_BRG_PHY_LP_TXVALIDESC_1 : R/W; bitpos: [9]; default: 0;
 *  txvalidesc_1 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXVALIDESC_1    (BIT(9))
#define DSI_BRG_PHY_LP_TXVALIDESC_1_M  (DSI_BRG_PHY_LP_TXVALIDESC_1_V << DSI_BRG_PHY_LP_TXVALIDESC_1_S)
#define DSI_BRG_PHY_LP_TXVALIDESC_1_V  0x00000001U
#define DSI_BRG_PHY_LP_TXVALIDESC_1_S  9
/** DSI_BRG_PHY_LP_TXLPDTESC_1 : R/W; bitpos: [10]; default: 0;
 *  txlpdtesc_1 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXLPDTESC_1    (BIT(10))
#define DSI_BRG_PHY_LP_TXLPDTESC_1_M  (DSI_BRG_PHY_LP_TXLPDTESC_1_V << DSI_BRG_PHY_LP_TXLPDTESC_1_S)
#define DSI_BRG_PHY_LP_TXLPDTESC_1_V  0x00000001U
#define DSI_BRG_PHY_LP_TXLPDTESC_1_S  10
/** DSI_BRG_PHY_LP_BASEDIR_1 : R/W; bitpos: [11]; default: 0;
 *  basedir_1 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_BASEDIR_1    (BIT(11))
#define DSI_BRG_PHY_LP_BASEDIR_1_M  (DSI_BRG_PHY_LP_BASEDIR_1_V << DSI_BRG_PHY_LP_BASEDIR_1_S)
#define DSI_BRG_PHY_LP_BASEDIR_1_V  0x00000001U
#define DSI_BRG_PHY_LP_BASEDIR_1_S  11
/** DSI_BRG_PHY_LP_TXDATAESC_0 : R/W; bitpos: [23:16]; default: 0;
 *  txdataesc_0 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXDATAESC_0    0x000000FFU
#define DSI_BRG_PHY_LP_TXDATAESC_0_M  (DSI_BRG_PHY_LP_TXDATAESC_0_V << DSI_BRG_PHY_LP_TXDATAESC_0_S)
#define DSI_BRG_PHY_LP_TXDATAESC_0_V  0x000000FFU
#define DSI_BRG_PHY_LP_TXDATAESC_0_S  16
/** DSI_BRG_PHY_LP_TXREQUESTESC_0 : R/W; bitpos: [24]; default: 0;
 *  txrequestesc_0 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXREQUESTESC_0    (BIT(24))
#define DSI_BRG_PHY_LP_TXREQUESTESC_0_M  (DSI_BRG_PHY_LP_TXREQUESTESC_0_V << DSI_BRG_PHY_LP_TXREQUESTESC_0_S)
#define DSI_BRG_PHY_LP_TXREQUESTESC_0_V  0x00000001U
#define DSI_BRG_PHY_LP_TXREQUESTESC_0_S  24
/** DSI_BRG_PHY_LP_TXVALIDESC_0 : R/W; bitpos: [25]; default: 0;
 *  txvalidesc_0 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXVALIDESC_0    (BIT(25))
#define DSI_BRG_PHY_LP_TXVALIDESC_0_M  (DSI_BRG_PHY_LP_TXVALIDESC_0_V << DSI_BRG_PHY_LP_TXVALIDESC_0_S)
#define DSI_BRG_PHY_LP_TXVALIDESC_0_V  0x00000001U
#define DSI_BRG_PHY_LP_TXVALIDESC_0_S  25
/** DSI_BRG_PHY_LP_TXLPDTESC_0 : R/W; bitpos: [26]; default: 0;
 *  txlpdtesc_0 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_TXLPDTESC_0    (BIT(26))
#define DSI_BRG_PHY_LP_TXLPDTESC_0_M  (DSI_BRG_PHY_LP_TXLPDTESC_0_V << DSI_BRG_PHY_LP_TXLPDTESC_0_S)
#define DSI_BRG_PHY_LP_TXLPDTESC_0_V  0x00000001U
#define DSI_BRG_PHY_LP_TXLPDTESC_0_S  26
/** DSI_BRG_PHY_LP_BASEDIR_0 : R/W; bitpos: [27]; default: 0;
 *  basedir_0 ctrl when enable dsi phy lp_loopback_test
 */
#define DSI_BRG_PHY_LP_BASEDIR_0    (BIT(27))
#define DSI_BRG_PHY_LP_BASEDIR_0_M  (DSI_BRG_PHY_LP_BASEDIR_0_V << DSI_BRG_PHY_LP_BASEDIR_0_S)
#define DSI_BRG_PHY_LP_BASEDIR_0_V  0x00000001U
#define DSI_BRG_PHY_LP_BASEDIR_0_S  27
/** DSI_BRG_PHY_LP_LOOPBACK_CHECK : WT; bitpos: [28]; default: 0;
 *  dsi phy lp_loopback test start check
 */
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK    (BIT(28))
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_M  (DSI_BRG_PHY_LP_LOOPBACK_CHECK_V << DSI_BRG_PHY_LP_LOOPBACK_CHECK_S)
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_V  0x00000001U
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_S  28
/** DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE : RO; bitpos: [29]; default: 0;
 *  dsi phy lp_loopback test check done
 */
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE    (BIT(29))
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE_M  (DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE_V << DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE_S)
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE_V  0x00000001U
#define DSI_BRG_PHY_LP_LOOPBACK_CHECK_DONE_S  29
/** DSI_BRG_PHY_LP_LOOPBACK_EN : R/W; bitpos: [30]; default: 0;
 *  dsi phy lp_loopback ctrl en
 */
#define DSI_BRG_PHY_LP_LOOPBACK_EN    (BIT(30))
#define DSI_BRG_PHY_LP_LOOPBACK_EN_M  (DSI_BRG_PHY_LP_LOOPBACK_EN_V << DSI_BRG_PHY_LP_LOOPBACK_EN_S)
#define DSI_BRG_PHY_LP_LOOPBACK_EN_V  0x00000001U
#define DSI_BRG_PHY_LP_LOOPBACK_EN_S  30
/** DSI_BRG_PHY_LP_LOOPBACK_OK : RO; bitpos: [31]; default: 0;
 *  result of dsi phy lp_loopback test
 */
#define DSI_BRG_PHY_LP_LOOPBACK_OK    (BIT(31))
#define DSI_BRG_PHY_LP_LOOPBACK_OK_M  (DSI_BRG_PHY_LP_LOOPBACK_OK_V << DSI_BRG_PHY_LP_LOOPBACK_OK_S)
#define DSI_BRG_PHY_LP_LOOPBACK_OK_V  0x00000001U
#define DSI_BRG_PHY_LP_LOOPBACK_OK_S  31

/** DSI_BRG_PHY_HS_LOOPBACK_CTRL_REG register
 *  dsi phy hp_loopback test ctrl
 */
#define DSI_BRG_PHY_HS_LOOPBACK_CTRL_REG (DR_REG_DSI_BRG_BASE + 0x98)
/** DSI_BRG_PHY_HS_TXDATAHS_1 : R/W; bitpos: [7:0]; default: 0;
 *  txdatahs_1 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_TXDATAHS_1    0x000000FFU
#define DSI_BRG_PHY_HS_TXDATAHS_1_M  (DSI_BRG_PHY_HS_TXDATAHS_1_V << DSI_BRG_PHY_HS_TXDATAHS_1_S)
#define DSI_BRG_PHY_HS_TXDATAHS_1_V  0x000000FFU
#define DSI_BRG_PHY_HS_TXDATAHS_1_S  0
/** DSI_BRG_PHY_HS_TXREQUESTDATAHS_1 : R/W; bitpos: [8]; default: 0;
 *  txrequestdatahs_1 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_1    (BIT(8))
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_1_M  (DSI_BRG_PHY_HS_TXREQUESTDATAHS_1_V << DSI_BRG_PHY_HS_TXREQUESTDATAHS_1_S)
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_1_V  0x00000001U
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_1_S  8
/** DSI_BRG_PHY_HS_BASEDIR_1 : R/W; bitpos: [9]; default: 1;
 *  basedir_1 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_BASEDIR_1    (BIT(9))
#define DSI_BRG_PHY_HS_BASEDIR_1_M  (DSI_BRG_PHY_HS_BASEDIR_1_V << DSI_BRG_PHY_HS_BASEDIR_1_S)
#define DSI_BRG_PHY_HS_BASEDIR_1_V  0x00000001U
#define DSI_BRG_PHY_HS_BASEDIR_1_S  9
/** DSI_BRG_PHY_HS_TXDATAHS_0 : R/W; bitpos: [23:16]; default: 0;
 *  txdatahs_0 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_TXDATAHS_0    0x000000FFU
#define DSI_BRG_PHY_HS_TXDATAHS_0_M  (DSI_BRG_PHY_HS_TXDATAHS_0_V << DSI_BRG_PHY_HS_TXDATAHS_0_S)
#define DSI_BRG_PHY_HS_TXDATAHS_0_V  0x000000FFU
#define DSI_BRG_PHY_HS_TXDATAHS_0_S  16
/** DSI_BRG_PHY_HS_TXREQUESTDATAHS_0 : R/W; bitpos: [24]; default: 0;
 *  txrequestdatahs_0 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_0    (BIT(24))
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_0_M  (DSI_BRG_PHY_HS_TXREQUESTDATAHS_0_V << DSI_BRG_PHY_HS_TXREQUESTDATAHS_0_S)
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_0_V  0x00000001U
#define DSI_BRG_PHY_HS_TXREQUESTDATAHS_0_S  24
/** DSI_BRG_PHY_HS_BASEDIR_0 : R/W; bitpos: [25]; default: 0;
 *  basedir_0 ctrl when enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_BASEDIR_0    (BIT(25))
#define DSI_BRG_PHY_HS_BASEDIR_0_M  (DSI_BRG_PHY_HS_BASEDIR_0_V << DSI_BRG_PHY_HS_BASEDIR_0_S)
#define DSI_BRG_PHY_HS_BASEDIR_0_V  0x00000001U
#define DSI_BRG_PHY_HS_BASEDIR_0_S  25
/** DSI_BRG_PHY_HS_TXREQUESTHSCLK : R/W; bitpos: [27]; default: 0;
 *  txrequesthsclk when  enable dsi phy hs_loopback_test
 */
#define DSI_BRG_PHY_HS_TXREQUESTHSCLK    (BIT(27))
#define DSI_BRG_PHY_HS_TXREQUESTHSCLK_M  (DSI_BRG_PHY_HS_TXREQUESTHSCLK_V << DSI_BRG_PHY_HS_TXREQUESTHSCLK_S)
#define DSI_BRG_PHY_HS_TXREQUESTHSCLK_V  0x00000001U
#define DSI_BRG_PHY_HS_TXREQUESTHSCLK_S  27
/** DSI_BRG_PHY_HS_LOOPBACK_CHECK : WT; bitpos: [28]; default: 0;
 *  dsi phy hs_loopback test start check
 */
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK    (BIT(28))
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_M  (DSI_BRG_PHY_HS_LOOPBACK_CHECK_V << DSI_BRG_PHY_HS_LOOPBACK_CHECK_S)
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_V  0x00000001U
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_S  28
/** DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE : RO; bitpos: [29]; default: 0;
 *  dsi phy hs_loopback test check done
 */
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE    (BIT(29))
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE_M  (DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE_V << DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE_S)
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE_V  0x00000001U
#define DSI_BRG_PHY_HS_LOOPBACK_CHECK_DONE_S  29
/** DSI_BRG_PHY_HS_LOOPBACK_EN : R/W; bitpos: [30]; default: 0;
 *  dsi phy hs_loopback ctrl en
 */
#define DSI_BRG_PHY_HS_LOOPBACK_EN    (BIT(30))
#define DSI_BRG_PHY_HS_LOOPBACK_EN_M  (DSI_BRG_PHY_HS_LOOPBACK_EN_V << DSI_BRG_PHY_HS_LOOPBACK_EN_S)
#define DSI_BRG_PHY_HS_LOOPBACK_EN_V  0x00000001U
#define DSI_BRG_PHY_HS_LOOPBACK_EN_S  30
/** DSI_BRG_PHY_HS_LOOPBACK_OK : RO; bitpos: [31]; default: 0;
 *  result of dsi phy hs_loopback test
 */
#define DSI_BRG_PHY_HS_LOOPBACK_OK    (BIT(31))
#define DSI_BRG_PHY_HS_LOOPBACK_OK_M  (DSI_BRG_PHY_HS_LOOPBACK_OK_V << DSI_BRG_PHY_HS_LOOPBACK_OK_S)
#define DSI_BRG_PHY_HS_LOOPBACK_OK_V  0x00000001U
#define DSI_BRG_PHY_HS_LOOPBACK_OK_S  31

/** DSI_BRG_PHY_LOOPBACK_CNT_REG register
 *  loopback test cnt
 */
#define DSI_BRG_PHY_LOOPBACK_CNT_REG (DR_REG_DSI_BRG_BASE + 0x9c)
/** DSI_BRG_PHY_HS_CHECK_CNT_TH : R/W; bitpos: [7:0]; default: 64;
 *  hs_loopback test check cnt
 */
#define DSI_BRG_PHY_HS_CHECK_CNT_TH    0x000000FFU
#define DSI_BRG_PHY_HS_CHECK_CNT_TH_M  (DSI_BRG_PHY_HS_CHECK_CNT_TH_V << DSI_BRG_PHY_HS_CHECK_CNT_TH_S)
#define DSI_BRG_PHY_HS_CHECK_CNT_TH_V  0x000000FFU
#define DSI_BRG_PHY_HS_CHECK_CNT_TH_S  0
/** DSI_BRG_PHY_LP_CHECK_CNT_TH : R/W; bitpos: [23:16]; default: 64;
 *  lp_loopback test check cnt
 */
#define DSI_BRG_PHY_LP_CHECK_CNT_TH    0x000000FFU
#define DSI_BRG_PHY_LP_CHECK_CNT_TH_M  (DSI_BRG_PHY_LP_CHECK_CNT_TH_V << DSI_BRG_PHY_LP_CHECK_CNT_TH_S)
#define DSI_BRG_PHY_LP_CHECK_CNT_TH_V  0x000000FFU
#define DSI_BRG_PHY_LP_CHECK_CNT_TH_S  16

#ifdef __cplusplus
}
#endif
